//省份  
var provinceArr = [];
provinceArr[0] = [ 'A' ];
provinceArr[1] = [ 'B' ];
provinceArr[2] = [ 'C' ];
provinceArr[3] = [ 'D' ];
provinceArr[4] = [ 'E' ];
provinceArr[5] = [ 'F' ];
provinceArr[6] = [ 'G' ];
provinceArr[7] = [ 'H' ];
provinceArr[8] = [ 'J' ];
provinceArr[9] = [ 'K' ];
provinceArr[10] = [ 'L' ];
provinceArr[11] = [ 'M' ];
provinceArr[12] = [ 'N' ];
provinceArr[13] = [ 'P' ];
provinceArr[14] = [ 'Q' ];
provinceArr[15] = [ 'R' ];
provinceArr[16] = [ 'S' ];
provinceArr[17] = [ 'T' ];
provinceArr[18] = [ 'W' ];
provinceArr[19] = [ 'X' ];
provinceArr[20] = [ 'Y' ];
provinceArr[21] = [ 'Z' ];

// 市县,每个数组第一个元素为省份,其他的为这个省份下的市县
var cityArr = [];
cityArr[0] = [ '鞍山', '安顺', '阿坝', '阿拉善', '阿里', '安康', '阿克苏', '安庆', '阿勒泰',
		'安阳', '澳门' ];
cityArr[1] = [ '北京', '包头', '保定', '巴中', '蚌埠', '白银', '白城', '白山', '北海',
		'巴彦淖尔', '宝鸡', '百色', '本溪', '保山', '毕节', '博尔塔拉', '滨州', '亳州', '巴州' ];
cityArr[2] = [ '成都', '重庆', '常州', '长沙', '长春', '赤峰', '楚雄', '长治', '巢湖',
		'崇左', '潮州', '昌吉', '沧州', '郴州', '常德', '滁州', '朝阳', '昌都', '池州',
		'承德' ];
cityArr[3] = [ '东莞', '大连', '东营', '大庆', '大同', '大理', '德阳', '迪庆',
		'达州', '德州', '丹东', '大兴安岭', '德宏', '定西' ];
cityArr[4] = [ '恩施', '鄂州', '鄂尔多斯' ];
cityArr[5] = [ '福州', '佛山', '抚顺', '阜阳', '抚州', '防城港', '阜新' ];
cityArr[6] = [ '广州', '贵阳', ' 桂林', '赣州', '广元', '果洛', '固原', '甘南', '甘孜',
		'广安', '贵港' ];
cityArr[7] = [ '杭州', '哈尔滨', '合肥', '邯郸', '惠州', '海口', '呼和浩特', '衡阳', '湖州',
		'淮北', '鹤岗', '海北', '海东', '黄南', '菏泽', '海南州', '黑河', '和田', '哈密', '淮安', '淮南' ,
		'黄山' , '海西', '贺州' , '怀化' , '河池' , '呼伦贝尔' , '衡水' , '河源' , '红河' , '汉中' ,
		'黄冈' , '黄石', '鹤壁', '葫芦岛' ];
cityArr[8] = [ '济南', '济宁', '嘉兴', '金华', '焦作', '荆州', '吉林', '锦州',
		'江门', '景德镇', '吉安', '酒泉', '金昌', '鸡西', '济源', '晋城', '揭阳', '晋中', '荆门', '九江' ];
cityArr[9] = [ '昆明', '昆山', '喀什', '克拉玛依', '开封', '克州' ];
cityArr[10] = [ '兰州', '临沂', '连云港', '聊城', '临汾', '柳州', '洛阳', '廊坊', '龙岩',
		'六盘水', '凉山', '丽江', '六安', '陇南', '临沧', '拉萨', '辽源', '辽阳', '莱芜', '漯河', '吕梁', '丽水'
		, '临夏', '林芝', '娄底', '来宾', '泸州', '乐山'];
cityArr[11] = [ '马鞍山', '绵阳', '茂名', '牡丹江', '梅州', '眉山' ];
cityArr[12] = [ '南京', '宁波', '南通', '南宁', '南昌', '南充', '宁德', '内江', '怒江','南平', '南阳', '那曲' ];
cityArr[13] = [ '萍乡', '平顶山', '莆田', '濮阳', '攀枝花', '平凉 ','普洱 ', '盘锦 ' ];
cityArr[14] = [ '青岛', '泉州', '秦皇岛', '齐齐哈尔', '庆阳', '衢州', '黔西南', '钦州', '黔南',
		'曲靖', '七台河', '黔东南', '清远' ];
cityArr[15] = [ '日照', '日喀则'];
cityArr[16] = [ '上海', '深圳', '沈阳', '石家庄', '苏州', '绍兴', '顺德', '三亚', '韶关',
		'绥化', '松原', '上饶' , '十堰' , '三门峡' , '山南' , '邵阳' , '遂宁' , '商丘' , '朔州' , '随州' 
		, '汕尾' , '四平' , '三峡' , '宿迁' , '三明' , '石嘴山' , '双鸭山' , '汕头' , '宿州' , '商洛' ];
cityArr[17] = [ '天津', '太原', '泰安', '台州', '唐山', '泰州', '塔城', '铜陵', '铜川',
		'台北', '吐鲁番', '铜仁', '天水', '通辽', '铁岭', '通化' ];
cityArr[18] = [ '武汉', '无锡', '温州', '芜湖', '威海', '潍坊', '乌鲁木齐', '梧州',
		'吴忠', '武威', '渭南', '乌兰察布', '文山', '乌海' ];
cityArr[19] = [ '西安', '厦门', '徐州', '襄阳', '西宁', '孝感', '西双版纳', '新余', '湘潭',
		'锡林郭勒', '兴安', '邢台', '新乡', '湘西', ' 忻州', ' 咸阳', ' 香港', ' 宣城', ' 信阳' , ' 咸宁' , '许昌' ];
cityArr[20] = [ '扬州', '烟台', '盐城', '运城', '义乌', '岳阳', '宜昌', '玉林', '银川',
		'鹰潭', '雅安', '伊犁', '玉树', '营口', '宜春', '永州', '宜宾', '益阳', '玉溪', '阳泉', '延安', '榆林', '云浮','延边', '阳江', '伊春' ];
cityArr[21] = [ '郑州', '镇江', '中山', '淄博', '珠海', '遵义', '株洲',
		'自贡', '舟山', '湛江', '肇庆', '漳州', '张掖', '昭通', '张家界', '周口', '驻马店' , '张家口', '资阳', '中卫', '枣庄'];

cityArr[22] = [ '宜春'];

/**
 * 
 * @param provinceId
 * @param cityId
 * @return
 */
function initDestCity(cityHtmlId){
		for ( var i = -1; i < provinceArr.length;i++) {
			if(i==-1){
				var html = '<li class="" id="cityhot"><p class="cf"><span class="label" style="border:none;background:#FFFFFF;"><strong style="background:#FFFFFF;border:none;"></strong></span><span>';
				for(var j=0;j<cityArr[22].length;j++){
					html +='<a class="isonline" href="javascript:void(0);" onclick="destPlaceClick(\''+cityArr[22][j]+'\')">'+cityArr[22][j]+'</a>';
				}
	            html +='</span></p></li>';
	            $("#"+cityHtmlId).append(html);
			}else{
				var html = '<li class="" id="city-'+provinceArr[i]+'"><p class="cf"><span class="label"><strong>'+provinceArr[i]+'</strong></span><span>';
					for(var j=0;j<cityArr[i].length;j++){
						html +='<a class="isonline" href="javascript:void(0);" onclick="destPlaceClick(\''+cityArr[i][j]+'\')">'+cityArr[i][j]+'</a>';
					}
		            html +='</span></p></li>';
				$("#"+cityHtmlId).append(html);
			}
		}
}

